app/controllers/addresses_controller.rb

SELECT  "addresses".* FROM "addresses"  ORDER BY created_at DESC LIMIT 1
---
  def index
    @address = Address.order("created_at").last

INSERT INTO "addresses" ("latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["latitude", 40.7119543], ["longitude", -73.9626877], ["created_at", "2016-06-28 20:23:15.690626"], ["updated_at", "2016-06-28 20:23:15.690626"]]
---
  def create
    @address = Address.new(params.require(:address).permit(:address))
    @address.save